In [1]:
%reload_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, 1543279932796, '88', 'paid', None, None, 961, 'Sacramento--Roseville--Arden-Arcade, CA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (2, 1543280209796, '88', 'paid', None, None, 961, 'Sacramento--Roseville--Arden-Arcade, CA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (3, 1543280448796, '88', 'paid', None, None, 961, 'Sacramento--Roseville--Arden-Arcade, CA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (4, 1543282396796, '38', 'free', None, None, 107, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (5, 1543282717796, '38', 'free', None, None, 107, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('88', 'Mohammad', 'Rodriguez', 'M', 'paid'),
 ('38', 'Gianna', 'Jones', 'F', 'free'),
 ('8', 'Kaylee', 'Summers', 'F', 'free'),
 ('66', 'Kevin', 'Arellano', 'M', 'free'),
 ('69', 'Anabelle', 'Simpson', 'F', 'free')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOFNOQK12AB01840FC', 'Kutt Free (DJ Volume Remix)', 'ARNNKDK1187B98BBD5', 0, Decimal('407.37914')),
 ('SOQOTLQ12AB01868D0', 'Clementina Santafè', 'ARGCY1Y1187B9A4FA5', 0, Decimal('153.33832')),
 ('SOTCKKY12AB018A141', 'Sonnerie lalaleulé hi houuu', 'ARGSAFR1269FB35070', 0, Decimal('29.54404')),
 ('SOOJPRH12A8C141995', 'Loaded Like A Gun', 'ARBGXIG122988F409D', 0, Decimal('173.19138')),
 ('SOLEYHO12AB0188A85', 'Got My Mojo Workin', 'ARAGB2O1187FB3A161', 0, Decimal('338.23302'))]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARNNKDK1187B98BBD5', 'Jinx', 'Zagreb Croatia', Decimal('45.80726'), Decimal('15.967600000000001')),
 ('ARGCY1Y1187B9A4FA5', 'Gloriana', 'Nashville, TN.', Decimal('36.16778'), Decimal('-86.77836')),
 ('ARGSAFR1269FB35070', 'Blingtones', '', Decimal('NaN'), Decimal('NaN')),
 ('ARBGXIG122988F409D', 'Steel Rain', 'California - SF', Decimal('37.77916'), Decimal('-122.42005')),
 ('ARAGB2O1187FB3A161', 'Pucho & His Latin Soul Brothers', '', Decimal('NaN'), Decimal('NaN'))]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.time(0, 25, 43, 279932), 0, 1, 1, 1, 1970, 3),
 (datetime.time(0, 25, 43, 280209), 0, 1, 1, 1, 1970, 3),
 (datetime.time(0, 25, 43, 280448), 0, 1, 1, 1, 1970, 3),
 (datetime.time(0, 25, 43, 282396), 0, 1, 1, 1, 1970, 3),
 (datetime.time(0, 25, 43, 282717), 0, 1, 1, 1, 1970, 3)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).